lvx/base/Documents/бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОперацийКазначейства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УдалитьХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КурсДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежаУпр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КратностьДокумента</Name>
					<Comment>Кратность документа</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_Важность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инициатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СверхБюджета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СценарииПланирования</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьОбъектРасчетов</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектРасчетов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>210</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписатьЛимиты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыЗначенийДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерНабора</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</Comment>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЗначениеДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уточнение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Чтение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Изменение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

lvx/base/Enums/бит_ВидыОперацийКазначейства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыОперацийКазначейства</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутренняяПередачаДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствВДругуюОрганизацию</Name>
					<Comment>Для наличных и безналичных расчетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствВДругуюКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхСредствПодотчетнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймаСотруднику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаЗаймов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплатыНаЛицевыеСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплатыПоЗарплатномуПроекту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплатыРаботнику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплатыРаздатчиком</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыплатаЗарплатыЧерезКассу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОплатыНаПлатежнуюКарту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнкассацияДенежныхСредствИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонвертацияВалюты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаАрендодателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаДенежныхСредствВДругуюОрганизацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоКредитам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеДенежныхСредствНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНаДепозиты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеТаможне</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеДенежныхСредствИзБанка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОплатыОтКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочаяВыдачаДенежныхСредств</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СдачаДенежныхСредствВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнкассацияДенежныхСредствВБанк</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеВБюджет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеДенежныхСредствИзДругойОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратДенежныхСредствОтДругойОрганизации</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Documents/бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
	
// Заполняет наборы значений доступа.
// Параметры:
//  Таблица - ТаблицаЗначений - передает в этот параметр подготовленные наборы значений
//            доступа. Описание колонок см. в функции УправлениеДоступом.ТаблицаНаборыЗначенийДоступа.
//
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	ДобавитьСтрокуВНаборЗначенийДоступа(Организация, Таблица);
	ДобавитьСтрокуВНаборЗначенийДоступа(ОрганизацияПолучатель, Таблица);
	КлючДоступаЦФОСтатьяОборотов = Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.КлючиЦФОСтатьяОборотовДокумента(
		ЦФО, Справочники.бит_СтатьиОборотов.ПустаяСсылка());
	ДобавитьСтрокуВНаборЗначенийДоступа(КлючДоступаЦФОСтатьяОборотов, Таблица);
	ДобавитьСтрокуВНаборЗначенийДоступа(Ответственный, Таблица);
	
	ТаблицаДанных = бит_УправлениеДоступомБФСлужебный.ДанныеПозицийПоЗаявке(Ссылка);
	
	Для каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		КлючДоступаЦФОСтатьяОборотов = Справочники.бит_КлючиДоступаЦФОСтатьиОборотов.КлючиЦФОСтатьяОборотовДокумента(
			СтрокаТаблицы.ЦФО, СтрокаТаблицы.СтатьяОборотов);
		ДобавитьСтрокуВНаборЗначенийДоступа(КлючДоступаЦФОСтатьяОборотов, Таблица);
	КонецЦикла; 
			
	// Удалим дубли
	ПоляГруппировки = "";
	Для каждого Колонка Из Таблица.Колонки Цикл
		ПоляГруппировки = "," + Колонка.Имя + ПоляГруппировки;
	КонецЦикла; 
	
	ПоляГруппировки = Сред(ПоляГруппировки, 2);
	Таблица.Свернуть(ПоляГруппировки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	ТекстСообщения = НСтр("ru = 'Документы этого типа больше не используются. Используйте ""Заявку на расходование"".'");
	ВызватьИсключение ТекстСообщения;
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанныхЗаполнения = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,, "ПометкаУдаления, Проведен");
	ИначеЕсли ТипДанныхЗаполнения = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями") Тогда
		ЗаполнитьНаОснованииПередачиТоваровМеждуОрганизациями(ДанныеЗаполнения);
	КонецЕсли;
	
	ИнициализироватьДокумент();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	//Ищем платежную позицию и позицию поступления по ссылке
	УстановитьПривилегированныйРежим(Истина);
	
	ЗначениеКопирования = Неопределено;
	ДополнительныеСвойства.Свойство("ЗначениеКопирования", ЗначениеКопирования);

	Если ЗначениеЗаполнено(ЗначениеКопирования) Тогда
		Выполнено = СкопироватьПозицииПриЗаписи(ЗначениеКопирования);
		
		Если НЕ Выполнено Тогда
			Отказ = Истина;			
		КонецЕсли;

		ДополнительныеСвойства.Вставить("ЗначениеКопирования", Неопределено);
		
	Иначе	
		ВыполнитьСинхронизацию(Отказ);		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ТекстСообщения = НСтр("ru = 'Документы этого типа больше не используются. Используйте ""Заявку на расходование"".'");
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если НЕ СверхБюджета Тогда
		СписатьЛимиты = Ложь;	
	КонецЕсли;

	бит_ОбщегоНазначенияПереопределяемый.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	ДополнительныеСвойства.Вставить("УстановкаПометкиУдаления", ПометкаУдаления <> Ссылка.ПометкаУдаления);

	Если НЕ ДополнительныеСвойства.УстановкаПометкиУдаления И НЕ ДополнительныеСвойства.ЭтоНовый Тогда
		Если ПолучитьФункциональнуюОпцию("бит_ЗапретитьИзменениеЗаявкиВключеннойВРеестр") Тогда
			ЗаявкаВключенаВРеестр = бит_Казначейство.ЗаявкаВключенаВРеестр(Ссылка);
		Иначе
			ЗаявкаВключенаВРеестр = Ложь;
		КонецЕсли;

		Если ЗаявкаВключенаВРеестр Тогда
			ТекстСообщения = НСтр("ru = 'Не удалось записать %1. Документ включен в реестр платежей.';
								|en = 'Failed to write to %1. The document is included in the payment register.'") ;
			ТекстСообщения = СтрШаблон(ТекстСообщения, Ссылка);
			ВызватьИсключение ТекстСообщения;		
		КонецЕсли;	
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ТекущийСтатус = бит_ВизированиеСервер.ТекущийСтатус(Ссылка);
	бит_Казначейство.ПроверитьВозможностьПроведения(Ссылка, ТекущийСтатус, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ТекущийСтатус = бит_ВизированиеСервер.ТекущийСтатус(Ссылка);
	бит_Казначейство.ПроверитьВозможностьПроведения(Ссылка, ТекущийСтатус, Отказ);

КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	НепроверяемыеРеквизиты = Новый Массив();
	
	Если бит_Казначейство.ОперацияБезНДС(ХозяйственнаяОперация) Тогда
		НепроверяемыеРеквизиты.Добавить("СтавкаНДС");	
	КонецЕсли;
	
	бит_НастройкиДоступностиЭлементовФорм.ЗаполнитьПроверяемыеРеквизиты(ЭтотОбъект, ПроверяемыеРеквизиты);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ТекстСообщения = НСтр("ru = 'Документы этого типа больше не используются. Используйте ""Заявку на расходование"".'");
	ВызватьИсключение ТекстСообщения;

	Ответственный = Пользователи.ТекущийПользователь();
	СверхБюджета  = Ложь;	
	СписатьЛимиты = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьСтрокуВНаборЗначенийДоступа(ЗначениеДоступа, Таблица)
	
	СтрокаТаб = Таблица.Добавить();
	СтрокаТаб.ЗначениеДоступа = ЗначениеДоступа;

КонецПроцедуры

//  Функция заполняет сценарий.
//
Функция ЗаполнитьСценарий() Экспорт 

	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЦФО", ЦФО);
	СтруктураПараметров.Вставить("Организация", Организация);
	
	ТекущаяДата = ?(ЗначениеЗаполнено(Дата), Дата, НачалоДня(ТекущаяДатаСеанса()));
	
	КонтролироватьЗаявку 	  = бит_НастройкиПрограммы.КонтролироватьЗаявкуПоБюджету(СтруктураПараметров, ТекущаяДата);
	СценарийКонтроляПоБюджету = бит_НастройкиПрограммы.КазначействоСценарийКонтроляПоБюджету(СтруктураПараметров, ТекущаяДата);
	
	Если КонтролироватьЗаявку Тогда
   		Возврат СценарийКонтроляПоБюджету;
	КонецЕсли; 
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьДокумент()
	
	Если НЕ ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ХозяйственнаяОперация) Тогда	
		ХозяйственнаяОперация = Перечисления.бит_ВидыОперацийКазначейства.ОплатаДенежныхСредствВДругуюОрганизацию;	
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ФормаОплаты) Тогда
		ФормаОплаты = Перечисления.бит_ВидыДенежныхСредств.Безналичные;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = ЗначениеНастроекПовтИсп.ПолучитьОрганизациюПоУмолчанию(Организация);
	КонецЕсли;

	Если ЗначениеЗаполнено(Сценарий) Тогда
		Сценарий = ЗаполнитьСценарий();
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(ЦФО) Тогда
		ЦФО = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(
										ПланыВидовХарактеристик.бит_НастройкиПользователей.ОсновнойЦФО);	
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ВалютаДокумента) Тогда
		ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
		ПриИзмененииВалютыДокумента();
	КонецЕсли; 
	
	Если КурсДокумента = 0 Тогда
		ПриИзмененииВалютыДокумента();
	КонецЕсли;
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Инициатор = бит_УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию(
					ПланыВидовХарактеристик.бит_НастройкиПользователей.ОсновнойИнициаторКазначейства);
	
	Если НЕ ЗначениеЗаполнено(Инициатор) Тогда
		Инициатор = Ответственный;
	КонецЕсли;

КонецПроцедуры

Процедура ПриИзмененииВалютыДокумента()
	
	Документы.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию.ПриИзмененииВалютыДокумента(ЭтотОбъект, Дата);
	
КонецПроцедуры

Процедура ВыполнитьСинхронизацию(Отказ)

	// синхронизируем реквизиты заявки и позиций
	РезультатПоискаПлатПоз = Документы.бит_кзн_ПлатежнаяПозиция.НайтиПозициюПоОснованию(Ссылка);
	РезультатПоискаПозПост = Документы.бит_кзн_ПозицияПоступления.НайтиПозициюПоОснованию(Ссылка);
	ИменаСинхр = Документы.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию.СинхронизируемыйРеквизитыДляПеремещения();
	
	ПлатежнаяПозиция   = РезультатПоискаПлатПоз.Позиция;
	ПозицияПоступления = РезультатПоискаПозПост.Позиция; 
		
	ПозицияОб     = ПлатежнаяПозиция.ПолучитьОбъект();
	ПоступлениеОб = ПозицияПоступления.ПолучитьОбъект();
	// признак того, что дальнейшая синхронизация не нужна, необходимо, чтобы не было циклических синхронизаций
	ПозицияОб.ДополнительныеСвойства.Вставить("НеСинхронизировать", Истина);
	ПоступлениеОб.ДополнительныеСвойства.Вставить("НеСинхронизировать", Истина);
	
	// синхронизация пометки удаления
	Если ПометкаУдаления <> ПозицияОб.ПометкаУдаления 
		ИЛИ ПометкаУдаления <> ПоступлениеОб.ПометкаУдаления Тогда
		
		ПозицияОб.УстановитьПометкуУдаления(ПометкаУдаления);
		ПоступлениеОб.УстановитьПометкуУдаления(ПометкаУдаления);
		
	КонецЕсли;
			
	Если Проведен Тогда
		
		флВыполнено1 = ПозицияОб.ПроверитьЗаполнение();
		Если флВыполнено1 Тогда
			флВыполнено1 = бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ПозицияОб, РежимЗаписиДокумента.Проведение, "", "Ошибки");
		Иначе 			
			ТекстСообщения = НСтр("ru='Не удалось провести платежную позицию №%1.';
								  |en='Unable to carry out payment position №%1.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ПозицияОб.Номер);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);			
		КонецЕсли;
		
		Если НЕ флВыполнено1 Тогда		
			Отказ = Истина;
			Возврат;		
		КонецЕсли; 
		
		флВыполнено2 = ПоступлениеОб.ПроверитьЗаполнение();
		Если флВыполнено2 Тогда
			флВыполнено2 = бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ПоступлениеОб, РежимЗаписиДокумента.Проведение, "", "Ошибки");
		Иначе			
			ТекстСообщения = НСтр("ru='Не удалось провести позицию поступления №%1.';
								  |en='Unable to hold revenue position №%1.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ПоступлениеОб.Номер);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		
		КонецЕсли;	
		
		Если НЕ флВыполнено2 Тогда		
			Отказ = Истина;
			Возврат;		
		КонецЕсли; 
		
	КонецЕсли;
	
	Если НЕ Проведен И ПозицияОб.Проведен Тогда
		
		флВыполнено1 = бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ПозицияОб, РежимЗаписиДокумента.ОтменаПроведения, "", "Ошибки");
		флВыполнено2 = бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ПоступлениеОб, РежимЗаписиДокумента.ОтменаПроведения, "", "Ошибки");
		Если НЕ флВыполнено1 ИЛИ НЕ флВыполнено2 Тогда
		
			Отказ = Истина;
			Возврат;
		
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

Процедура ЗаполнениеНаОснованииОперации(Списание, Поступление)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВнутренняяПередача", 	Перечисления.бит_ВидыОперацийКазначейства.ВнутренняяПередачаДенежныхСредств);
	Запрос.УстановитьПараметр("ОплатаДенежныхСредств",  Перечисления.бит_ВидыОперацийКазначейства.ОплатаДенежныхСредствВДругуюОрганизацию);
	Запрос.УстановитьПараметр("ВозвратДенежныхСредств", Перечисления.бит_ВидыОперацийКазначейства.ВозвратДенежныхСредствВДругуюОрганизацию);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация",  ХозяйственнаяОперация);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыОперацийКазначейства.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВидыОпераций
	|ИЗ
	|	Перечисление.бит_ВидыОперацийКазначейства КАК ВидыОперацийКазначейства
	|ГДЕ
	|	ВидыОперацийКазначейства.Ссылка В (&ВнутренняяПередача, &ОплатаДенежныхСредств, &ВозвратДенежныхСредств)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_СтатьиОборотов.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ДоступныеСтатьи
	|ИЗ
	|	Справочник.бит_СтатьиОборотов КАК бит_СтатьиОборотов
	|ГДЕ
	|	бит_СтатьиОборотов.Предопределенный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоступныеСтатьи.Ссылка КАК Списание,
	|	ДоступныеСтатьи1.Ссылка КАК Поступление,
	|	ВидыОпераций.Ссылка КАК Ссылка2
	|ИЗ
	|	ВидыОпераций КАК ВидыОпераций
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоступныеСтатьи КАК ДоступныеСтатьи
	|		ПО (ДоступныеСтатьи.Ссылка.ИмяПредопределенныхДанных = ""ВнутренняяПередачаДС_расходование"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоступныеСтатьи КАК ДоступныеСтатьи1
	|		ПО (ДоступныеСтатьи1.Ссылка.ИмяПредопределенныхДанных = ""ВнутренняяПередачаДС_поступление"")
	|ГДЕ
	|	ВидыОпераций.Ссылка = &ВнутренняяПередача
	|	И ВидыОпераций.Ссылка = &ХозяйственнаяОперация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДоступныеСтатьи.Ссылка,
	|	ДоступныеСтатьи1.Ссылка,
	|	ВидыОпераций.Ссылка
	|ИЗ
	|	ВидыОпераций КАК ВидыОпераций
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоступныеСтатьи КАК ДоступныеСтатьи
	|		ПО (ДоступныеСтатьи.Ссылка.ИмяПредопределенныхДанных = ""ОплатаВДругуюОрганизацию_Расходование"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоступныеСтатьи КАК ДоступныеСтатьи1
	|		ПО (ДоступныеСтатьи1.Ссылка.ИмяПредопределенныхДанных = ""ОплатаВДругуюОрганизацию_Поступление"")
	|ГДЕ
	|	ВидыОпераций.Ссылка = &ОплатаДенежныхСредств
	|	И ВидыОпераций.Ссылка = &ХозяйственнаяОперация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДоступныеСтатьи.Ссылка,
	|	ДоступныеСтатьи1.Ссылка,
	|	ВидыОпераций.Ссылка
	|ИЗ
	|	ВидыОпераций КАК ВидыОпераций
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоступныеСтатьи КАК ДоступныеСтатьи
	|		ПО (ДоступныеСтатьи.Ссылка.ИмяПредопределенныхДанных = ""ОплатаВДругуюОрганизацию_Расходование"")
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоступныеСтатьи КАК ДоступныеСтатьи1
	|		ПО (ДоступныеСтатьи1.Ссылка.ИмяПредопределенныхДанных = ""ОплатаВДругуюОрганизацию_Поступление"")
	|ГДЕ
	|	ВидыОпераций.Ссылка = &ВозвратДенежныхСредств
	|	И ВидыОпераций.Ссылка = &ХозяйственнаяОперация";
		
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Списание.СтатьяОборотов	   = ВыборкаДетальныеЗаписи.Списание;
		Поступление.СтатьяОборотов = ВыборкаДетальныеЗаписи.Поступление;
	КонецЦикла;

КонецПроцедуры // ЗаполнениеНаОснованииОперации()

Процедура ЗаполнитьНаОснованииПередачиТоваровМеждуОрганизациями(ДанныеЗаполнения)
	
	ЗаполняемыеРеквизиты = "Организация, ОрганизацияПолучатель, ФормаОплаты";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, ЗаполняемыеРеквизиты);
	
	ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию;
	ВалютаДокумента = ДанныеЗаполнения.Валюта;
	ФормаОплаты     = Перечисления.бит_ВидыДенежныхСредств.Безналичные;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(ПередачаТоваровМеждуОрганизациямиТовары.СуммаСНДС) КАК СуммаДокумента,
	|	СУММА(ПередачаТоваровМеждуОрганизациямиТовары.СуммаНДС) КАК СуммаНДС,
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПередачаТоваровМеждуОрганизациямиТовары.СтавкаНДС), 0) КАК ВариацияСтавок,
	|	МАКСИМУМ(ПередачаТоваровМеждуОрганизациямиТовары.СтавкаНДС) КАК СтавкаНДС
	|ИЗ
	|	Документ.ПередачаТоваровМеждуОрганизациями.Товары КАК ПередачаТоваровМеждуОрганизациямиТовары
	|ГДЕ
	|	ПередачаТоваровМеждуОрганизациямиТовары.Ссылка = &ДанныеЗаполнения";
	Запрос.УстановитьПараметр("ДанныеЗаполнения", ДанныеЗаполнения);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СуммаДокумента = Выборка.СуммаДокумента;
		СуммаНДС       = Выборка.СуммаНДС;
		Если Выборка.ВариацияСтавок = 1 Тогда
			СтавкаНДС = Выборка.СтавкаНДС;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция СкопироватьПозицииПриЗаписи(ЗначениеКопирования)
	
	Выполнено = Истина;
	
	РезультатПоиска = Документы.бит_кзн_ПлатежнаяПозиция.НайтиПозициюПоОснованию(ЗначениеКопирования);
	Если ЗначениеЗаполнено(РезультатПоиска.Позиция) Тогда
		РеквизитыДокумента = Документы.бит_кзн_ПлатежнаяПозиция.РеквизитыДокумента(РезультатПоиска.Позиция);
		ДанныеЗаполнения   = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РеквизитыДокумента[0]);
		
		Исключения = Новый Структура;
		Исключения.Вставить("Cсылка", 				   Неопределено);
		Исключения.Вставить("Дата", 				   Дата);
		Исключения.Вставить("Номер", 				   "");
		Исключения.Вставить("Проведен", 			   Ложь);
		Исключения.Вставить("ПометкаУдаления", 		   Ложь);
		Исключения.Вставить("ДокументОснование", 	   Неопределено);
		Исключения.Вставить("ДокументПланирования",    Ссылка);
		Исключения.Вставить("ОтправленНаСогласование", Ложь);
		
		ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, Исключения); 
		
		Позиция = Документы.бит_кзн_ПлатежнаяПозиция.СоздатьДокумент();
		Позиция.Заполнить(ДанныеЗаполнения);
		
		Позиция.ДополнительныеСвойства.Вставить("НеСинхронизировать", Истина);
		Выполнено = бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(Позиция, РежимЗаписиДокумента.Запись, , "Ошибки");
	КонецЕсли;
	
	Если НЕ Выполнено Тогда
		Возврат Выполнено;
	КонецЕсли;
	
	РезультатПоиска = Документы.бит_кзн_ПозицияПоступления.НайтиПозициюПоОснованию(ЗначениеКопирования);
	Если ЗначениеЗаполнено(РезультатПоиска.Позиция) Тогда
		РеквизитыДокумента = Документы.бит_кзн_ПозицияПоступления.РеквизитыДокумента(РезультатПоиска.Позиция);
		ДанныеЗаполнения   = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РеквизитыДокумента[0]);
		
		Исключения = Новый Структура;
		Исключения.Вставить("Cсылка", 				   Неопределено);
		Исключения.Вставить("Дата", 				   Дата);
		Исключения.Вставить("Номер", 				   "");
		Исключения.Вставить("Проведен", 			   Ложь);
		Исключения.Вставить("ПометкаУдаления", 		   Ложь);
		Исключения.Вставить("ДокументОснование", 	   Неопределено);
		Исключения.Вставить("ДокументПланирования",    Ссылка);
		Исключения.Вставить("ОтправленНаСогласование", Ложь);
		
		ЗаполнитьЗначенияСвойств(ДанныеЗаполнения, Исключения); 
		
		Позиция = Документы.бит_кзн_ПозицияПоступления.СоздатьДокумент();
		Позиция.Заполнить(ДанныеЗаполнения);
		
		Позиция.ДополнительныеСвойства.Вставить("НеСинхронизировать", Истина);
		Выполнено = бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(Позиция, РежимЗаписиДокумента.Запись, , "Ошибки");
	КонецЕсли;
	
	Возврат Выполнено;

КонецФункции

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
